app/controllers/api/v1/users_controller.rb

    def update
        @user = User.find(params[:id])
        @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "bio" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["bio", "We came, we saw, we kicked its ass! \n - froms ome other film\n"], ["updated_at", "2019-09-04 13:14:44.258299"], ["id", 1]]