app/controllers/application_controller.rb

  def set_current_user
      token = get_token
      if token
          decoded_token = decode_token(token)
          @current_user = User.find(decoded_token[0]["user_id"].to_i)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]