app/models/user.rb

SELECT "users".* FROM "users"
---
  def self.find_by_slug(slug)
      User.all.find { |user| user.slug == slug}